{"rating": 2.8, "votes": 47, "title": "Last Wishes Joke", "url": "http://www.greatcleanjokes.com/3212/last-wishes-joke/", "content": "Old Max had started out as a diamond cutter, and through hard work and good judgement he finally became the owner of a National chain of jewelry stores.  He was wealthy indeed.  \nBut now, he lay dying, so he called his wife to his side. “Hannah,” he began, “I always meant to draw up a will but somehow I never got around to it.  So pay close to attention to my last wishes.”\n“Yes, Max, I am listening,” Hannah wept.  “Whatever you want, it will be done.”  \n“First of all, the business I leave to Harry.”\n“Oh, no, Max, not to Harry!”  his wife protested.  “With Harry it’s girl-girls-girls!  Leave the business better to Jerome.  He’s at least reliable and has a good head for figures.”\n“Alright, let it be Jerome,” sighed the dying man.  “To Harry I leave the stocks and bonds.”\n“Better you should leave me the stocks and bonds.  I should take care he doesn’t squander it on women or cards.”\n“Very well, in your name I leave the securities.  And the summer house I leave to our sweet Minnie.”\n“Minnie!”  exclaimed his wife.  “What for what does Minnie need another summer house?  Her husband didn’t buy her one last year?  Give it to Anna – her husband is a poor man.  After all she’s our flesh and blood too.”\n“Fine!  Anna gets the summer house,” he sighed resignedly.  “And to our youngest Abe, I leave the car and the warehouses.”\n“But Abe has already 2 cars.  What does he need with another one?  And he wants to be a musician – what would he do with warehouses?  Take my advice and give them to Louis.”\nThat did it! Old Max had taken all he could of his wife’s interference.  Raising himself off the pillow and summoning his last ounce of strength, he snapped, “Hannah, you are a good women and have been a fine wife and mother.  But listen – who the hell is dying around here – you or me?”\n", "comments_count": 0, "id": 13, "categories": [{"subcategory_id": "114", "category_id": "114", "subcategory_name": "Death Jokes", "category_name": "Death Humor"}]}