{"rating": 4.2, "votes": 120, "title": "Ark Joke", "url": "http://www.greatcleanjokes.com/2836/ark-joke/", "content": "In the year 2010, the Lord came unto Noah, who was now living in the United States, and said: Once again the earth has become wicked and over-populated, and I see the end of all flesh before me.\nBuild another Ark and save 2 of every living thing long with a few good humans.\nHe gave Noah the blueprints, saying: You have 6 months to build the Ark before I will start\nthe unending rain for 40 days and 40 nights.\nSix months later, the Lord looked down and saw Noah weeping in his yard – but no Ark.\nNoah! He roared, I’m about to start the rain! Where is the Ark ?\nForgive me, Lord, begged Noah, but things have changed.\nI needed a building permit.\nI’ve been arguing with the inspector about the need for a sprinkler system.\nMy neighbors claim that I’ve violated the neighborhood zoning laws by building the Ark in my yard and exceeding the height limitations. We had to go to the Development Appeal Board for a decision.\nThen the Department of Transportation demanded a bond be posted for the future costs of moving power lines and other overhead obstructions, to clear the passage for the Ark ‘s move to the sea.\nI told them that the sea would be coming to us, but they would hear nothing of it.\nGetting the wood was another problem. There’s a ban on cutting local trees in order to save the spotted owl.\nI tried to convince the environmentalists that I needed the wood to save the owls – but no go!\nWhen I started gathering the animals, an animal rights group sued me.\nThey insisted that I was confining wild animals against their will.\nThey argued the accommodations were too restrictive, and it was cruel and inhumane to put so many animals in a confined space.\nThen the EPA ruled that I couldn’t build the Ark until they’d conducted an environmental impact study on your proposed flood.\nI’m still trying to resolve a complaint with the Human Rights Commission on how many minorities I’m supposed to hire for my building crew.\nImmigration is checking the status of most of the people who want to work.\nThe trade unions say I can’t use my sons. They insist I have to hire only Union workers with Ark-building experience.\nTo make matters worse, they seized all my assets, claiming I’m trying to leave the country illegally with endangered species.\nSo, forgive me, Lord, but it would take at least 10 years for me to finish this ark.\nSuddenly the skies cleared, the sun began to shine, and a rainbow stretched across the sky.\nNoah looked up in wonder and asked, “You mean you’re not going to destroy the world?”\n“No,” said the Lord.\n“The government beat me to it.”\n", "comments_count": 7, "id": 584, "categories": [{"subcategory_id": "204", "category_id": "134", "subcategory_name": "Work Jokes", "category_name": "Work Humor"}]}