{"rating": 4.3, "votes": 36, "title": "Differences between Men and Women", "url": "http://www.greatcleanjokes.com/3146/differences-between-men-and-women/", "content": "• Women have more imagination than men. They need it to tell men how wonderful they are.\n• Women have a number of faults. Men have only two – everything they say and everything they do.\n• A successful man is one who makes more money than his wife can spend. A successful woman is one who can find such a man.\n• Men wake up as good-looking as they went to bed. Women somehow deteriorate during the night.\n• When women are depressed they either eat or go shopping. When men are depressed, they invade another country.\n• A man is a person who will pay £2 for a £1 item he wants. A woman, however, will pay £1 for a £2 item that she doesn’t want.\n• Diamonds are a girl’s best friend. Dogs are a man’s best friend. Now you know which sex is smarter.\n• It’s not true that men prefer foolish women. Rather they prefer women who can pretend to be foolish whenever necessary, which is the very core of intelligence.\n• Men always want to be a woman’s first love. Women have a more subtle instinct: What they like is to be a man’s last romance.\n• To be happy with a man, a woman must understand him a lot and love him a little. To be happy with a woman, a man must love her a lot and not try to understand her at all.\n• A woman marries a man expecting he will change, but he doesn’t. A man marries a woman expecting that she won’t change and she does.\n• Men marry because they are tired; women marry because they are curious. Both are disappointed.\n• A woman worries about the future until she gets a husband, while a man never worries about the future until he gets a wife.\n• A woman will always cherish the memory of the man who wanted to marry her; a man will always cherish the memory of the woman who he didn’t.\n• There are two times when a man doesn’t understand a woman – before marriage and after marriage.\n• Only two things are necessary for a man to do to keep his wife happy. One is to let her think she is having her own way, and the other is to let her have it.\n• Married men live longer than single men, but married men are a lot more willing to die.\n• Any married man should forget his mistakes – it’s no use two people remembering the same thing.\n• Some husbands are living proof that a woman can take a joke.\n• Husbands are like cars: all are good the first year.\n• A woman has the last word in any argument. Anything a man says after that is the beginning of a new argument.\n", "comments_count": 0, "id": 346, "categories": [{"subcategory_id": "159", "category_id": "123", "subcategory_name": "Husband Wife Jokes", "category_name": "Marriage Humor"}, {"subcategory_id": "161", "category_id": "123", "subcategory_name": "Marriage Jokes", "category_name": "Marriage Humor"}, {"subcategory_id": "174", "category_id": "125", "subcategory_name": "Men Jokes", "category_name": "People Jokes"}, {"subcategory_id": "176", "category_id": "125", "subcategory_name": "Women Jokes", "category_name": "People Jokes"}]}